#2020041500机器学习

#python介绍
#1、一种面向对象，面向函数的解释型计算程序语言。
#2、荷兰人Guido van Rossum于1989年发明，第一个版本发布于1991年

#python的历史
# 3、Python的作者是Guido van Rossum（龟叔）
# 4、Python是龟叔在1989年圣诞节期间，为了打发无聊的圣诞节而用C编写的一个编程语言
# 5、Python正式诞生于1991年
# 6、 Python的解释器如今有多个语言实现，我们常用的是CPython（官方版本的C语言实现），7、其他还有Jython（可以运行在Java平台）、IronPython（可以运行在.NET和Mono平台）、PyPy（Python实现的，支持JIT即时编译）
# 8、Python目前有两个版本，Python2和Python3，最新版分别为2.7.13和3.6.2，现阶段大部分公司用的是Python2，Life is shot, you need Python. 人生苦短，我用Python。

#python的特点
#1、简单
#2、易学
#3、免费、开源
#4、高层语言
#5、可移植性，在windows和linux等等平台都可以运行
#6、解释性，一个用编译性语言比如C或C++写的程序可以从源文件（即C或C++语言）转换到一个你的计算机使用的语言（二进制代码，即0和1）。
# 这个过程通过编译器和不同的标记、选项完成。当你运行你的程序的时候，连接/转载器软件把你的程序从硬盘复制到内存中并且运行。
# 而Python语言写的程序不需要编译成二进制代码。你可以直接从源代码运行程序。在计算机内部，Python解释器把源代码转换成称为字节码的中间形式，然后再把它翻译成计算机使用的机器语言并运行。
#7、面向对象————Python既支持面向过程的编程也支持面向对象的编程。在“面向过程”的语言中，程序是由过程或仅仅是可重用代码的函数构建起来的。在“面向对象”的语言中，程序是由数据和功能组合而成的对象构建起来的。
#8、可扩展性————如果你需要你的一段关键代码运行得更快或者希望某些算法不公开，你可以把你的部分程序用C或C++编写，然后在你的Python程序中使用它们。
#9、丰富的库————Python标准库确实很庞大。它可以帮助你处理各种工作，包括正则表达式、文档生成、单元测试、线程、数据库、网页浏览器、CGI、FTP、电子邮件、XML、XML-RPC、HTML、WAV文件、密码系统、GUI（图形用户界面）、Tk和其他与系统有关的操作。
#10、规范的代码————Python采用强制缩进的方式使得代码具有极佳的可读性。

#python应用场景
#1、Web应用开发:mod_wsgi模块,Web框架Django,TurboGears,web2py,Zope等
#2、操作系统关联、服务器运维的自动化脚本：Python编写的系统管理脚本在可读性、性能、代码重用度、扩展性几方面都优于普通的shell脚本。
#3、科学计算机器学习：NumPy,SciPy,Matplotlib可以让Python程序员编写科学计算程序。
#4、服务器软件（网络软件） --阿里云
